; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p13---int100n150-m25---int100c200---s393---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level10 level10)
(sum level0 level14 level14)
(sum level0 level16 level16)
(sum level0 level23 level23)
(sum level1 level1 level2)
(sum level1 level10 level11)
(sum level1 level14 level15)
(sum level1 level16 level17)
(sum level1 level23 level24)
(sum level2 level1 level3)
(sum level2 level10 level12)
(sum level2 level14 level16)
(sum level2 level16 level18)
(sum level2 level23 level25)
(sum level3 level1 level4)
(sum level3 level10 level13)
(sum level3 level14 level17)
(sum level3 level16 level19)
(sum level3 level23 level26)
(sum level4 level1 level5)
(sum level4 level10 level14)
(sum level4 level14 level18)
(sum level4 level16 level20)
(sum level4 level23 level27)
(sum level5 level1 level6)
(sum level5 level10 level15)
(sum level5 level14 level19)
(sum level5 level16 level21)
(sum level5 level23 level28)
(sum level6 level1 level7)
(sum level6 level10 level16)
(sum level6 level14 level20)
(sum level6 level16 level22)
(sum level6 level23 level29)
(sum level7 level1 level8)
(sum level7 level10 level17)
(sum level7 level14 level21)
(sum level7 level16 level23)
(sum level7 level23 level30)
(sum level8 level1 level9)
(sum level8 level10 level18)
(sum level8 level14 level22)
(sum level8 level16 level24)
(sum level8 level23 level31)
(sum level9 level1 level10)
(sum level9 level10 level19)
(sum level9 level14 level23)
(sum level9 level16 level25)
(sum level9 level23 level32)
(sum level10 level1 level11)
(sum level10 level10 level20)
(sum level10 level14 level24)
(sum level10 level16 level26)
(sum level10 level23 level33)
(sum level11 level1 level12)
(sum level11 level10 level21)
(sum level11 level14 level25)
(sum level11 level16 level27)
(sum level11 level23 level34)
(sum level12 level1 level13)
(sum level12 level10 level22)
(sum level12 level14 level26)
(sum level12 level16 level28)
(sum level12 level23 level35)
(sum level13 level1 level14)
(sum level13 level10 level23)
(sum level13 level14 level27)
(sum level13 level16 level29)
(sum level13 level23 level36)
(sum level14 level1 level15)
(sum level14 level10 level24)
(sum level14 level14 level28)
(sum level14 level16 level30)
(sum level15 level1 level16)
(sum level15 level10 level25)
(sum level15 level14 level29)
(sum level15 level16 level31)
(sum level16 level1 level17)
(sum level16 level10 level26)
(sum level16 level14 level30)
(sum level16 level16 level32)
(sum level17 level1 level18)
(sum level17 level10 level27)
(sum level17 level14 level31)
(sum level17 level16 level33)
(sum level18 level1 level19)
(sum level18 level10 level28)
(sum level18 level14 level32)
(sum level18 level16 level34)
(sum level19 level1 level20)
(sum level19 level10 level29)
(sum level19 level14 level33)
(sum level19 level16 level35)
(sum level20 level1 level21)
(sum level20 level10 level30)
(sum level20 level14 level34)
(sum level20 level16 level36)
(sum level21 level1 level22)
(sum level21 level10 level31)
(sum level21 level14 level35)
(sum level22 level1 level23)
(sum level22 level10 level32)
(sum level22 level14 level36)
(sum level23 level1 level24)
(sum level23 level10 level33)
(sum level24 level1 level25)
(sum level24 level10 level34)
(sum level25 level1 level26)
(sum level25 level10 level35)
(sum level26 level1 level27)
(sum level26 level10 level36)
(sum level27 level1 level28)
(sum level28 level1 level29)
(sum level29 level1 level30)
(sum level30 level1 level31)
(sum level31 level1 level32)
(sum level32 level1 level33)
(sum level33 level1 level34)
(sum level34 level1 level35)
(sum level35 level1 level36)

(connected l0 l1)
(fuelcost level14 l0 l1)
(connected l0 l2)
(fuelcost level23 l0 l2)
(connected l0 l3)
(fuelcost level16 l0 l3)
(connected l1 l0)
(fuelcost level14 l1 l0)
(connected l1 l2)
(fuelcost level1 l1 l2)
(connected l1 l3)
(fuelcost level10 l1 l3)
(connected l2 l0)
(fuelcost level23 l2 l0)
(connected l2 l1)
(fuelcost level1 l2 l1)
(connected l2 l3)
(fuelcost level1 l2 l3)
(connected l3 l0)
(fuelcost level16 l3 l0)
(connected l3 l1)
(fuelcost level10 l3 l1)
(connected l3 l2)
(fuelcost level1 l3 l2)

(at t0 l0)
(fuel t0 level36)
(= (total-cost) 0)

(at p0 l0)
(at p1 l2)
(at p2 l1)
(at p3 l1)
(at p4 l2)
(at p5 l2)
(at p6 l1)
(at p7 l1)
(at p8 l0)
(at p9 l0)
(at p10 l0)
(at p11 l2)
(at p12 l1)
)

(:goal
(and
(at p0 l3)
(at p1 l3)
(at p2 l3)
(at p3 l2)
(at p4 l1)
(at p5 l1)
(at p6 l3)
(at p7 l2)
(at p8 l1)
(at p9 l2)
(at p10 l2)
(at p11 l1)
(at p12 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p9 t0 l0)
   deleted: (at p9 l0)
   added: (in p9 t0)
   goals met: 0 of 13
2. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 0 of 13
3. (load p10 t0 l0)
   deleted: (at p10 l0)
   added: (in p10 t0)
   goals met: 0 of 13
4. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 13
5. (drive t0 l0 l2 level13 level23 level36)
   deleted: (at t0 l0) (fuel t0 level36)
   added: (at t0 l2) (fuel t0 level13)
   goals met: 0 of 13
6. (load p5 t0 l2)
   deleted: (at p5 l2)
   added: (in p5 t0)
   goals met: 0 of 13
7. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 0 of 13
8. (load p11 t0 l2)
   deleted: (at p11 l2)
   added: (in p11 t0)
   goals met: 0 of 13
9. (drive t0 l2 l1 level12 level1 level13)
   deleted: (at t0 l2) (fuel t0 level13)
   added: (at t0 l1) (fuel t0 level12)
   goals met: 0 of 13
10. (unload p8 t0 l1)
   deleted: (in p8 t0)
   added: (at p8 l1)
   goals met: 1 of 13
11. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 2 of 13
12. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 3 of 13
13. (unload p11 t0 l1)
   deleted: (in p11 t0)
   added: (at p11 l1)
   goals met: 4 of 13
14. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 4 of 13
15. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 4 of 13
16. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 4 of 13
17. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 4 of 13
18. (load p12 t0 l1)
   deleted: (at p12 l1)
   added: (in p12 t0)
   goals met: 4 of 13
19. (drive t0 l1 l2 level11 level1 level12)
   deleted: (at t0 l1) (fuel t0 level12)
   added: (at t0 l2) (fuel t0 level11)
   goals met: 4 of 13
20. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 4 of 13
21. (unload p10 t0 l2)
   deleted: (in p10 t0)
   added: (at p10 l2)
   goals met: 5 of 13
22. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 6 of 13
23. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 7 of 13
24. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 8 of 13
25. (drive t0 l2 l3 level10 level1 level11)
   deleted: (at t0 l2) (fuel t0 level11)
   added: (at t0 l3) (fuel t0 level10)
   goals met: 8 of 13
26. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 9 of 13
27. (unload p1 t0 l3)
   deleted: (in p1 t0)
   added: (at p1 l3)
   goals met: 10 of 13
28. (unload p12 t0 l3)
   deleted: (in p12 t0)
   added: (at p12 l3)
   goals met: 11 of 13
29. (unload p2 t0 l3)
   deleted: (in p2 t0)
   added: (at p2 l3)
   goals met: 12 of 13
30. (unload p6 t0 l3)
   deleted: (in p6 t0)
   added: (at p6 l3)
   goals met: 13 of 13
